Tekla.Structures.Geometry3d.FacetedBrepWithNormals
The FacetedBRepWithNormals class defines a faceted BREP that has also vertex normal vectors.
vertices:
The vertex geometries.
outerWires:
The outer wires as a two dimensional array. Integer indexes are used for identifying the
corresponding vertex for the node in the wire from the array provided by parameter vertices.
innerWires:
The inner wires also known as inner loops or holes.
normals:
Normal unit vectors for each vertex in vertices.
public void Example()
{
/* See the method InsertUsingNormals in the ShapeItem class for a code example*/
}

Tekla.Structures.Geometry3d.FacetedBrepWithNormals.#ctor(Tekla.Structures.Geometry3d.Vector[],System.Int32[][],System.Collections.Generic.IDictionary{System.Int32,System.Int32[][]},Tekla.Structures.Geometry3d.Vector[])
Constructor for FacetedBRepWithNormals

Tekla.Structures.Geometry3d.FacetedBrepWithNormals.Normals
Get and set the vertex normal unit vectors